import steamlit as st

#ส่วนที่ 1 หัวข้อหน้าเว็บ (title สีเเดง)
st.markdown("# :red[🏋️ คำนวณค่าดัชนีมวลกาย   BMI]")
st.write("กรอกข้อมูลน้ำหนักเเละส่วนสูงของคุณ เพื่อเช็คสุขภาพเบื้องต้น")

#ส่วนที่2สร้างช่องรับค่าน้ำหนัก เเละ ส่วนสูง
weight = st.number_input("กรอกน้ำหนักของคุณ (กิโลกรัม):",min_value=1.0, value=1.0)
height_cm = st.number_input("กรอกส่วนสูงของคุณ (เซนติเมตร):", min_value=1.0, value=1.0)

#ส่วนที่ 3 สร้างปุ่มกดคำนวณ
if st.button("คำนวณค่าBMI 🎯"):
    # เเปลงส่วนสูง cm เป็น เมตร เเล้วคำนวณ BMI
    height_m = height_cm / 100
    bmi = weight / (height_m ** 2)

    st.write("---")      
    st.header(f"ค่า BMI ของคุณคือ: **{bmi:.2f}**")

#ส่วนที่ 4 เเปลผลค่า BMI ตามเกณฑ์
 if bmi < 18.5:
     st.warning("⚠️  คุณมีน้ำหนักน้อยกว่าเกณฑ์ (ผอม)")
 elif 18.5 <= bmi < 23.0:
     st.success("🎉 คุณมีน้ำหนักอยู่ในเกณฑ์ปกติ (สุขภาพดี)")
 elif 23.0 <= bmi < 25.0:
     st.info("💡 คุณเริ่มมีน้ำหนักเกินเกณฑ์ (ท้วม)")
 else:
st.error("🚨 คุณอยู่ในเกณฑ์อ้วน ควรระวังเรื่องสุขภาพเเละออกกำลังกาย")

st.divider()
st.write("นางสาวดีใจ ยิ้มเเย้ม เลขที่ 5 ม.4/15")
